:PROPERTIES:
:NAME: Sarjor
:RACE: Elf
:CLASS: Ranger
:XP: 350
:NEXTXP: 1000
:LEVEL: 1
:HALFLEVEL: 0
:END:
#+title: Sarjor
#+STARTUP: overview

* Abilities
#+TBLNAME: Abilities
| Ability | Score | Mod | +1/2L |
|---------+-------+-----+-------|
| STR     |    11 |   0 |     0 |
| CON     |    14 |   2 |     2 |
| DEX     |    18 |   4 |     4 |
| INT     |    10 |   0 |     0 |
| WIS     |    16 |   3 |     3 |
| CHA     |    10 |   0 |     0 |
#+TBLFM: $3='(int-to-string (floor (/ (- $2 10) 2)));N
#+TBLFM: $4='(+ $3 (string-to-number (org-entry-get nil "HALFLEVEL" t)));N


* Defense
| Total |      | 10 + | Arm. | Abil. | Class | Feat | Enh. | Misc | Temp |
|       |      | 1/2L |      |       |       |      |      |      |      |
|-------+------+------+------+-------+-------+------+------+------+------|
|    18 | AC   |   10 |    3 |     4 |       |      |    1 |      |      |
|    13 | FORT |   10 |      |     2 |     1 |      |      |      |      |
|    15 | REF  |   10 |      |     4 |     1 |      |      |      |      |
|    13 | WILL |   10 |      |     3 |       |      |      |      |      |
#+TBLFM: $3='(+ 10 (string-to-number (org-entry-get nil "HALFLEVEL" t)))
#+TBLFM: $1=($3 + $4 + $5 + $6 + $7 + $8 + $9 + $10)
** Attack Workspace
| Weapon/Power        | Attack | 1/2L | Abil. | Class | Prof | Feat | Enh | Misc |
|---------------------+--------+------+-------+-------+------+------+-----+------|
| Melee Basic Attack  |     +8 |    0 |     4 |       |    3 |    1 |     |      |
| Ranged Basic Attack |     +7 |    0 |     4 |       |    2 |    1 |     |      |
| Dual Weapon Attack  |     +8 |    0 |     4 |       |    3 |    1 |     |      |
| Fading Strike       |     +8 |    0 |     4 |       |    3 |    1 |     |      |
| Nimble Strike       |     +8 |    0 |     4 |       |    3 |    1 |     |      |
| Scything Blow       |     +8 |    0 |     4 |       |    3 |    1 |     |      |
#+TBLFM: $3='(org-entry-get nil "HALFLEVEL" t)
#+TBLFM: $2='(concat "+" (int-to-string (+ $3 $4 $5 $6 $7 $8 $9)));N
** Damage Workspace
| Weapon/Power        | Bonus | Ability | Feat | Enh | Misc | Misc |
|---------------------+-------+---------+------+-----+------+------|
| Melee Basic Attack  |    +5 |       4 |    1 |     |      |      |
| Ranged Basic Attack |    +5 |       4 |    1 |     |      |      |
| Dual Weapon Attack  |    +5 |       4 |    1 |     |      |      |
| Power Strike        |    +1 |         |    1 |     |      |      |
| Fading Strike       |    +5 |       4 |    1 |     |      |      |
| Nimble Strike       |    +5 |       4 |    1 |     |      |      |
| Scything Blow       |    +5 |       4 |    1 |     |      |      |
#+TBLFM: $2='(concat "+" (int-to-string (-sum '($3 $4 $5 $6))));N
* Skills
| Mod | Name          | Abil. | Train | Mod+ | Armor | Misc | Temp |
|     |               |       |       | 1/2L |       |      |      |
|-----+---------------+-------+-------+------+-------+------+------|
|  +9 | Acrobatics    | DEX   |     1 |    4 |       |      |      |
|  +0 | Arcana        | INT   |       |    0 |       |      |      |
|  +5 | Athletics     | STR   |     1 |    0 |       |      |      |
|  +0 | Bluff         | CHA   |       |    0 |       |      |      |
|  +1 | Diplomacy     | CHA   |       |    0 |       |    1 |      |
|  +3 | Dungeoneering | WIS   |       |    3 |       |      |      |
|  +2 | Endurance     | CON   |       |    2 |       |      |      |
|  +3 | Heal          | WIS   |       |    3 |       |      |      |
|  +0 | History       | INT   |       |    0 |       |      |      |
|  +3 | Insight       | WIS   |       |    3 |       |      |      |
|  +0 | Intimidate    | CHA   |       |    0 |       |      |      |
| +10 | Nature        | WIS   |     1 |    3 |       |    2 |      |
| +10 | Perception    | WIS   |     1 |    3 |       |    2 |      |
|  +0 | Religion      | INT   |       |    0 |       |      |      |
|  +9 | Stealth       | DEX   |     1 |    4 |       |      |      |
|  +0 | Streetwise    | CHA   |       |    0 |       |      |      |
|  +4 | Theivery      | DEX   |       |    4 |       |      |      |
#+TBLFM: $5='(org-lookup-first $3 '(remote(Abilities,@2$1..@>$1)) '(remote(Abilities,@2$4..@>$4)))
#+TBLFM: $1='(concat "+" (int-to-string (+ $5 $6 $7 $8 (if (eql $4 1) 5 0))));N
** Equipment
  | Name                    | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |-------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Longbow                 |        1 |        50 |            2 |                  2 |              50 |
  | Longsword               |        1 |        15 |            4 |                  4 |              15 |
  | Short sword             |        1 |        10 |            2 |                  2 |              10 |
  | Backpack                |        1 |         2 |            5 |                  5 |               2 |
  | Bedroll                 |        1 |        .1 |            2 |                  2 |             0.1 |
  | Tinderbox               |        1 |        .5 |            1 |                  1 |             0.5 |
  | Ration                  |       10 |        .5 |            1 |                 10 |              5. |
  | Waterskin               |        1 |        .2 |            5 |                  5 |             0.2 |
  | Hempen Rope (50ft)      |        1 |         1 |           10 |                 10 |               1 |
  | Arrows                  |       60 |       .05 |           .1 |                 6. |              3. |
  | +1 Defensive Hide Armor |        1 |       680 |           25 |                 25 |             680 |
  | Hide Armor              |        1 |        30 |           25 |                 25 |              30 |
  |-------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity          |      100 |           |              |                97. |           796.8 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @>$5=vsum(@<<$5..@>>$5)
  #+TBLFM: @>$6=vsum(@<<$6..@>>$6)


